Examinator/src/ExchangePlans/ОбменМатериаламиСУЗ/ОбменМатериаламиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="9bc99607-c6e6-435f-9cd6-d09156ac3541">
  <name>ОбменМатериаламиСУЗ</name>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПакетаДанных</name>
    <type>
      <types>EnumRef.ТипыПакетовДанныхСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПакетДляЭкспорта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспортироватьДанныеДоДаты</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспортироватьДанныеПослеДаты</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспортироватьТолькоПомеченныеНаУдаление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспортироватьПоследнююВерсию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СохранитьПоследнююВерсию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредпочитатьПоставщика</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоИмпортированныйПакет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьИмпортИзКаталогаШаблонов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерРедакции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПодредакции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЭлементыДляЭкспорта</name>
    <attributes>
      <name>СсылкаНаЭлемент</name>
      <type>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
        <types>CatalogRef.СодержаниеСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДопустимыеПакетыДанных</name>
    <attributes>
      <name>НомерПакетаДанных</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПакетДанных</name>
      <type>
        <types>ExchangePlanRef.ОбменМатериаламиСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExchangePlan>

Examinator/src/Enums/ТипыПакетовДанныхСУЗ/ТипыПакетовДанныхСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПакетовДанныхСУЗ</name>
  <enumValues>
    <name>XML_V8</name>
  </enumValues>
  <enumValues>
    <name>SCORM_2004</name>
  </enumValues>
  <enumValues>
    <name>E4HOME</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/ExchangePlans/ОбменМатериаламиСУЗ/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УзелЭтойБазы = ПланыОбмена.ОбменМатериаламиСУЗ.ЭтотУзел();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    ОбъектыСУЗКлиент.УстановитьЭлектронныеРесурсы();
	
	Элементы.Импорт.Обновить();
						
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЭкспорт

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Экспорт

&НаКлиенте
Процедура ЭкспортПриАктивизацииСтроки(Элемент)
	УстановитьДоступностьЭлементовФормыНаКлиенте();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура КомандаИмпорт(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжениеЗагрузкиФайла", ЭтотОбъект);		
		
	НачатьПомещениеФайла(ОписаниеОповещения,,, Истина, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжениеЗагрузкиФайла(Результат, АдресФайла, ИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат Тогда
		Возврат;
	КонецЕсли;
	
	Файл = Новый Файл(ИмяФайла);
	
	Если Файл.Расширение = ".zip" Тогда
		
		Если Сред(Файл.ИмяБезРасширения, 1, 7) = "E4HOME_" Тогда
			ИмяФормыДляИмпорта = "ПланОбмена.ОбменМатериаламиСУЗ.Форма.ФормаИмпортаПакетаЦОР";	
		Иначе
			ИмяФормыДляИмпорта = "ПланОбмена.ОбменМатериаламиСУЗ.Форма.ФормаИмпортаПакетаSCORM";	
		КонецЕсли;
		
	КонецЕсли;
	
	Если Файл.Расширение = ".xml" Тогда
		ИмяФормыДляИмпорта = "ПланОбмена.ОбменМатериаламиСУЗ.Форма.ФормаИмпортаПакетаXML";
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(ИмяФормыДляИмпорта) Тогда
		Текст = НСтр("ru = 'Неизвестный формат файла'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Возврат;
	КонецЕсли;
	
	Если Файл.Расширение = ".intuit" Тогда
		ПутьКФайлуПакетаДанных = ИмяФайла;
	Иначе
		ПутьКФайлуПакетаДанных = ОбъектыСУЗ.ПолучитьПутьКПакетуДанных(АдресФайла, ИмяФайла);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ПутьКФайлуПакета", ПутьКФайлуПакетаДанных);
	
	ОткрытьФорму(ИмяФормыДляИмпорта, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЭкспорт(Команда)
	
	ТекущиеДанные = Элементы.Экспорт.ТекущиеДанные;
	
	Если НЕ ОбщегоНазначенияСУКлиент.ТекущиеДанныеТаблицыДоступны(ТекущиеДанные) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ТипПакетаДанных = ПредопределенноеЗначение("Перечисление.ТипыПакетовДанныхСУЗ.XML_V8") Тогда
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("Узел", ТекущиеДанные.Ссылка);
		
		ОткрытьФорму("ПланОбмена.ОбменМатериаламиСУЗ.Форма.ФормаЭкспортаXML", ПараметрыФормы);
		
	КонецЕсли;
	
	Если ТекущиеДанные.ТипПакетаДанных = ПредопределенноеЗначение("Перечисление.ТипыПакетовДанныхСУЗ.SCORM_2004") Тогда
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("Узел", ТекущиеДанные.Ссылка);
		
		ОткрытьФорму("ПланОбмена.ОбменМатериаламиСУЗ.Форма.ФормаЭкспортаSCORM", ПараметрыФормы);
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура УстановитьДоступностьЭлементовФормыНаКлиенте()
	
	Если Элементы.Экспорт.ТекущиеДанные <> Неопределено Тогда
	
		АктивныйЭлементДляЭкспорта = Элементы.Экспорт.ТекущиеДанные.Ссылка;
		
		Если АктивныйЭлементДляЭкспорта = УзелЭтойБазы Тогда
			Элементы.ЭкспортЭкспорт.Доступность = Ложь;
		Иначе
			Элементы.ЭкспортЭкспорт.Доступность = Истина;
		КонецЕсли;
		
	Иначе
		
		Элементы.ЭкспортЭкспорт.Доступность = Ложь;
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
